In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'Cap_bac': ['Quản lý', 'Trưởng nhóm', ' Nhân viên', 'Mới ra trường'],
                  'Luong_trung_binh': ['30.000.000 VNĐ', '20.000.000đ', '15.600.000 vnđ', '7.500.000 vnĐ']})
df

         Cap_bac Luong_trung_binh
0        Quản lý   30.000.000 VNĐ
1    Trưởng nhóm      20.000.000đ
2      Nhân viên   15.600.000 vnđ
3  Mới ra trường    7.500.000 vnĐ

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Cap_bac           4 non-null      object
 1   Luong_trung_binh  4 non-null      object
dtypes: object(2)
memory usage: 192.0+ bytes

In [6]:
df['Luong_trung_binh_number'] = df['Luong_trung_binh'].str.lower()
df['Luong_trung_binh_number'] = df['Luong_trung_binh_number'].str.replace(' vnđ','')
df['Luong_trung_binh_number'] = df['Luong_trung_binh_number'].str.replace('đ','')
df['Luong_trung_binh_number'] = df['Luong_trung_binh_number'].str.replace('.','')
df['Luong_trung_binh_number'] = df['Luong_trung_binh_number'].astype(float)

In [17]:
df['Luong_trung_binh_number'] = df['Luong_trung_binh'].str.lower().str.replace(' vnđ','')\
                                .str.replace('đ','').str.replace('.','').astype(float)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Cap_bac                  4 non-null      object
 1   Luong_trung_binh         4 non-null      object
 2   Luong_trung_binh_number  4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [8]:
df

         Cap_bac Luong_trung_binh  Luong_trung_binh_number
0        Quản lý   30.000.000 VNĐ               30000000.0
1    Trưởng nhóm      20.000.000đ               20000000.0
2      Nhân viên   15.600.000 vnđ               15600000.0
3  Mới ra trường    7.500.000 vnĐ                7500000.0

In [18]:
def xu_ly_luong(luong):
#     luong = luong.lower()
#     luong = luong.replace(' vnđ','')
#     luong = luong.replace('đ','')
#     luong = luong.replace('.','')
#     return float(luong)
    return float(luong.lower().replace(' vnđ','').replace('đ','').replace('.',''))

In [19]:
xu_ly_luong('20.000.000đ')

20000000.0

In [14]:
df['Luong_trung_binh_number2'] = df['Luong_trung_binh'].apply(xu_ly_luong)
df['Luong_trung_binh_number3'] = df['Luong_trung_binh'].apply(lambda x: xu_ly_luong(x))

In [15]:
df

,Cap_bac,Luong_trung_binh,Luong_trung_binh_number,Luong_trung_binh_number2,Luong_trung_binh_number3
0,Quản lý,30.000.000 VNĐ,30000000.0,30000000.0,30000000.0
1,Trưởng nhóm,20.000.000đ,20000000.0,20000000.0,20000000.0
2,Nhân viên,15.600.000 vnđ,15600000.0,15600000.0,15600000.0
3,Mới ra trường,7.500.000 vnĐ,7500000.0,7500000.0,7500000.0

## xử lý trùng

In [20]:
df2 = pd.DataFrame({'A':['foo', 'foo', 'foo', 'bar'],
                    'B': [0, 1, 1, 1,],
                    'C': ['A', 'A', 'B', 'A']})
df2

     A  B  C
0  foo  0  A
1  foo  1  A
2  foo  1  B
3  bar  1  A

In [23]:
df_new1 = df2.drop_duplicates(subset=['A', 'C'], keep=False)
df_new1

     A  B  C
2  foo  1  B
3  bar  1  A

In [24]:
df_new2 = df2.drop_duplicates(subset=['A', 'C'], keep='first')
df_new2

     A  B  C
0  foo  0  A
2  foo  1  B
3  bar  1  A

In [25]:
df_new3 = df2.drop_duplicates(subset=['A', 'C'], keep='last')
df_new3

     A  B  C
1  foo  1  A
2  foo  1  B
3  bar  1  A